[
    {
        "ID / المعرف": "T1560",
        "المعرف الفرعي": "",
        "الاسم/ Name": "سحب البيانات المؤرشفة / Archive Collected Data",
        "الوصف / Description": "يقوم المهاجم في أرشفة أو تشفير البيانات التي تم جمعها قبل تسريبها. يمكن أن يساعد أرشفة البيانات في تعتيم البيانات التي تم تجميعها وتقليل كمية البيانات المرسلة عبر الشبكة. يمكن استخدام التشفير لإخفاء المعلومات التي يتم تسريبها من عملية الاكتشاف أو جعل التطفل أقل وضوحًا عند الفحص بواسطة المحلل."
    },
    {
        "ID / المعرف": "T1560",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "اداة الارشفة  Archive via Utility",
        "الوصف / Description": "قد يقوم المهاجم بضغط أو تشفير البيانات التي تم جمعها قبل سحبها من الضحية باستخدام أدوات مساعدة تابعة لطرف ثالث. توجد العديد من الأدوات المساعدة التي يمكنها أرشفة البيانات، بما في ذلك 7-Zip و WinRAR و WinZip.تتضمن معظم الأدوات المساعدة وظائف لتشفير أو ضغط البيانات."
    },
    {
        "ID / المعرف": "T1560",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "الارشفة بواسطة المكتبات البرمجية / Archive via Library",
        "الوصف / Description": "قد يقوم المهاجم بضغط أو تشفير البيانات التي تم جمعها قبل سحبها من الضحية باستخدام مكتبات الطرف الثالث. توجد العديد من المكتبات التي يمكنها أرشفة البيانات، بما في ذلك Python rarfile و libzip و zlib.تتضمن معظم المكتبات وظائف لتشفير أو ضغط البيانات."
    },
    {
        "ID / المعرف": "T1560",
        "المعرف الفرعي": ".003",
        "الاسم/ Name": "الارشفة بواسطة طرق مخصصة / Archive via Custom Method",
        "الوصف / Description": "قد يقوم المهاجم في ضغط أو تشفير البيانات التي تم جمعها قبل سحبها من الضحية باستخدام طريقة مخصصة.قد يختار المهاجمين استخدام أساليب أرشفة مخصصة، مثل التشفير باستخدام XOR أو استخدام stream ciphers التي يتم تنفيذها بدون مراجع مكتبة خارجية أو أداة مساعدة. كما ايضا قد يتم استخدام تطبيقات مخصصة لخوارزميات الضغط المعروفة."
    },
    {
        "ID / المعرف": "T1123",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسجيل الاصوات / Audio Capture",
        "الوصف / Description": "يمكن للمهاجم الاستفادة من الأجهزة الطرفية للكمبيوتر (مثل الميكروفونات وكاميرات الويب) أو التطبيقات (مثل خدمات مكالمات الصوت والفيديو) لالتقاط التسجيلات الصوتية بغرض الاستماع إلى المحادثات الحساسة لجمع المعلومات."
    },
    {
        "ID / المعرف": "T1119",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تنزيل البيانات بشكل آلي / Automated Collection",
        "الوصف / Description": "بمجرد إنشائه داخل نظام أو شبكة، قد يستخدم المهاجم تقنيات آلية لجمع البيانات الداخلية. يمكن أن تتضمن طرق تنفيذ هذه التقنية استخدام مترجم الأوامر والنصوص للبحث عن المعلومات ونسخها التي تناسب معايير المجموعة مثل نوع,موقع أو الاسم الملف في فترات زمنية محددة. يمكن أيضًا تضمين هذه الوظيفة في أدوات الوصول عن بُعد."
    },
    {
        "ID / المعرف": "T1115",
        "المعرف الفرعي": "",
        "الاسم/ Name": "البيانات المنسوخة / Clipboard Data",
        "الوصف / Description": "قد يقوم المهاجمين بجمع البيانات المخزنة في clipboard من المستخدمين الذين يقومون بنسخ المعلومات داخل أو بين التطبيقات."
    },
    {
        "ID / المعرف": "T1530",
        "المعرف الفرعي": "",
        "الاسم/ Name": "البيانات المخزنة في المخازن السحابية / Data from Cloud Storage Object",
        "الوصف / Description": "قد يصل المهاجمين إلى البيانات التي في التخزين السحابي المؤمَّن بطريقة غير صحيحة."
    },
    {
        "ID / المعرف": "T1602",
        "المعرف الفرعي": "",
        "الاسم/ Name": "بيانات الاعدادات المخزنة في المستودعات / Data from Configuration Repository",
        "الوصف / Description": "قد يقوم المهاجمين بجمع البيانات المتعلقة بالأجهزة المُدارة من المستودعات. يتم استخدام المستودعات بواسطة أنظمة الإدارة من أجل تكوين البيانات وإدارتها والتحكم فيها على الأنظمة البعيدة. قد تسهل المستودعات أيضًا الوصول عن بُعد وإدارة الأجهزة."
    },
    {
        "ID / المعرف": "T1602",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "SNMP (MIB Dump)",
        "الوصف / Description": "قد يستهدف المهاجمين قاعدة المعلومات الإدارية (MIB) لجمع أو استخراج معلومات قيمة في شبكة مُدارة باستخدام بروتوكول(SNMP)."
    },
    {
        "ID / المعرف": "T1602",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "تنزيل اعدادات اجهزة الشبكات المخزنة / Network Device Configuration Dump",
        "الوصف / Description": "قد يصل المهاجمين إلى ملفات تكوين الشبكة لجمع بيانات حساسة حول الجهاز والشبكة. تكوين الشبكة عبارة عن ملف يحتوي على معلمات تحدد تشغيل الجهاز. يخزن الجهاز عادةً نسخة في الذاكرة من التكوين أثناء التشغيل، وتكوين منفصل على وحدة تخزين غير مستقرة للتحميل بعد إعادة ضبط الجهاز. يمكن للمهاجمين فحص ملفات التكوين للكشف عن معلومات حول الشبكة المستهدفة وتخطيطها، وجهاز الشبكة وبرامجه، أو تحديد الحسابات وبيانات الاعتماد الشرعية لاستخدامها لاحقًا."
    },
    {
        "ID / المعرف": "T1213",
        "المعرف الفرعي": "",
        "الاسم/ Name": "البيانات المتوفرة في المستودعات / Data from Information Repositories",
        "الوصف / Description": "قد يستفيد المهاجمين من مستودعات البيانات لاستخراج المعلومات القيمة. مستودعات البيانات هي أدوات تسمح بتخزين المعلومات، عادةً لتسهيل التعاون أو مشاركة المعلومات بين المستخدمين، ويمكن تخزين مجموعة متنوعة من البيانات التي قد تساعد المهاجمين في أهداف أخرى، أو الوصول المباشر إلى المعلومات الهدف."
    },
    {
        "ID / المعرف": "T1213",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "مذكرة / Confluence",
        "الوصف / Description": "قد يستفيد المهاجمين من مستودعات Confluence لاستخراج المعلومات القيمة. غالبًا ما توجد في بيئات التطوير جنبًا إلى جنب مع Atlassian JIRA، يتم استخدام Confluence بشكل عام لتخزين الوثائق المتعلقة بالتنمية، ومع ذلك، قد تحتوي بشكل عام على فئات أكثر تنوعًا من المعلومات المفيدة."
    },
    {
        "ID / المعرف": "T1213",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "نظام / Sharepoint",
        "الوصف / Description": "قد يستفيد المهاجمين من مستودع SharePoint كمصدر لاستخراج المعلومات القيمة. غالبًا ما يحتوي SharePoint على معلومات مفيدة للمهاجم للتعرف على بنية ووظائف الشبكة والأنظمة الداخلية."
    },
    {
        "ID / المعرف": "T1005",
        "المعرف الفرعي": "",
        "الاسم/ Name": "البيانات من النظام المحلي / Data from Local System",
        "الوصف / Description": "قد يبحث المهاجمين عن مصادر النظام المحلي، مثل أنظمة الملفات أو قواعد البيانات المحلية، للعثور على الملفات ذات الأهمية والبيانات الحساسة قبل عملية الاستخراج."
    },
    {
        "ID / المعرف": "T1039",
        "المعرف الفرعي": "",
        "الاسم/ Name": "البيانات المتوفرة في مجلدات المشاركة / Data from Network Shared Drive",
        "الوصف / Description": "قد يبحث المهاجمين عن مشاركات الشبكة على أجهزة الكمبيوتر التي قاموا باختراقها للعثور على الملفات التي تهمهم. يمكن جمع البيانات الحساسة من أنظمة خارج الشبكة عبر محركات أقراص الشبكة المشتركة(الدليل المشترك المضيف، خادم ملفات الشبكة، إلخ) التي يمكن الوصول إليها من النظام الحالي قبل تسريبها الى خارج الشبكة. قد تكون الأوامر في الطرفية التفاعلية قيد الاستخدام، ويمكن استخدام الوظائف الشائعة داخل cmd لجمع المعلومات."
    },
    {
        "ID / المعرف": "T1025",
        "المعرف الفرعي": "",
        "الاسم/ Name": "البيانات من وسائط التخزين المتنقلة / Data from Removable Media",
        "الوصف / Description": "قد يبحث المهاجمين عن الوسائط القابلة للإزالة المتصلة على أجهزة الكمبيوتر التي قاموا باختراقها للعثور على الملفات التي تهمهم. يمكن جمع البيانات الحساسة من أي وسائط قابلة للإزالة (محرك الأقراص الضوئية ، ذاكرة USB ، إلخ) متصلة بالنظام المخترق قبل عملية الاستخراج. قد تكون الأوامر من الطرفية التفاعلية قيد الاستخدام، ويمكن استخدام الوظائف الشائعة داخل cmd لجمع المعلومات."
    },
    {
        "ID / المعرف": "T1074",
        "المعرف الفرعي": "",
        "الاسم/ Name": "البيانات المخزنة / Data Staged",
        "الوصف / Description": "قد يقوم المهاجمين بتنظيم البيانات التي تم جمعها في مسار مركزي أو مجلد قبل عملية تسريبها اى خارج الشبكة. يمكن الاحتفاظ بالبيانات في ملفات منفصلة أو دمجها في ملف واحد من خلال تقنيات مثل أرشفة البيانات Archive. يمكن استخدام الأوامر الطرفية التفاعلية، ويمكن استخدام الوظائف الشائعة داخل cmd و bash لنسخ البيانات إلى موقع تجريبي."
    },
    {
        "ID / المعرف": "T1074",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "البيانات المخزنة محلياً / Local Data Staging",
        "الوصف / Description": "قد يقوم المهاجمين بوضع البيانات التي تم جمعها في موقع مركزي أو مجلد على النظام المحلي قبل عملية تسريبها الى خارج الشبكة. يمكن الاحتفاظ بالبيانات في ملفات منفصلة أو دمجها في ملف واحد من خلال تقنيات مثل أرشفة البيانات Archive. يمكن استخدام الأوامر الطرفية التفاعلية، ويمكن استخدام الوظائف الشائعة داخل cmd و bash لنسخ البيانات إلى موقع تجريبي."
    },
    {
        "ID / المعرف": "T1074",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "البيانات المخزنة عن بعد / Remote Data Staging",
        "الوصف / Description": "قد يحاول المهاجمين وضع أنفسهم بين جهازين أو أكثر من الأجهزة المتصلة بالشبكة باستخدام تقنية man-in-the-middle (MiTM) لدعم سلوكيات المتابعة مثل التنصت في الشبكة أو التلاعب في البيانات المنقولة. من خلال إساءة استخدام ميزات بروتوكولات الشبكات الشائعة التي يمكنها تحديد تدفق حركة مرور الشبكة (مثل ARP و DNS و LLMNR وما إلى ذلك)، قد يجبر المهاجمين جهازًا على الاتصال من خلال نظام يتم التحكم فيه من قِبل المهاجم حتى يتمكنوا من جمع المعلومات أو تنفيذ اهداف إضافية."
    },
    {
        "ID / المعرف": "T1114",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تنزيل البريد الالكتروني / Email Collection",
        "الوصف / Description": "قد يستهدف المهاجمين البريد الإلكتروني للمستخدم لجمع معلومات حساسة. قد تحتوي رسائل البريد الإلكتروني على بيانات حساسة، بما في ذلك الأسرار التجارية أو المعلومات الشخصية، والتي يمكن أن تكون مفيدة للمهاجمين. يمكن للمهاجمين جمع البريد الإلكتروني أو إعادة توجيهه من خوادم البريد أو العملاء."
    },
    {
        "ID / المعرف": "T1114",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "تنزيل البريد الداخلي / Local Email Collection",
        "الوصف / Description": "قد يستهدف المهاجمين البريد الإلكتروني للمستخدم على الأنظمة المحلية لجمع معلومات حساسة. يمكن الحصول على الملفات التي تحتوي على بيانات البريد الإلكتروني من النظام المحلي للمستخدم، مثل تخزين Outlook أو ملفات ذاكرة التخزين المؤقت."
    },
    {
        "ID / المعرف": "T1114",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "تنزيل البريد عن بعد / Remote Email Collection",
        "الوصف / Description": "قد يقوم المهاجمين بإعداد قواعد إعادة توجيه البريد الإلكتروني لجمع المعلومات الحساسة. قد يسيء المهاجمين استخدام قواعد إعادة توجيه البريد الإلكتروني لمراقبة أنشطة الضحية، وسرقة المعلومات، واكتساب المزيد من المعلومات الاستخبارية عن الضحية أو منظمة الضحية لاستخدامها كجزء من عمليات استغلال أو عمليات أخرى. يسمح Outlook و Outlook Web App (OWA) للمستخدمين بإنشاء قواعد علبة الوارد لوظائف البريد الإلكتروني المختلفة، بما في ذلك إعادة التوجيه إلى مستلم مختلف. وبالمثل ، يمكن لمستخدمي أو مسؤولي Google Workspace إعداد قواعد إعادة توجيه البريد عبر واجهة ويب Google Workspace. يمكن إعادة توجيه الرسائل إلى مستلمين داخليين أو خارجيين، ولا توجد قيود تحد من مدى هذه القاعدة. يمكن للمسؤولين أيضًا إنشاء قواعد إعادة التوجيه لحسابات المستخدمين بنفس الاعتبارات والنتائج."
    },
    {
        "ID / المعرف": "T1114",
        "المعرف الفرعي": ".003",
        "الاسم/ Name": "قواعد تمرير البريد / Email Forwarding Rule",
        "الوصف / Description": "قد يستخدم المهاجمين طرقًا لجمع مدخلات المستخدم للحصول على بيانات الحسابات أو جمع المعلومات. أثناء الاستخدام العادي للنظام، غالبًا ما يوفر المستخدمون بيانات اعتماد لمواقع مختلفة مختلفة، مثل صفحات  أو بوابات تسجيل الدخول أو مربعات حوار النظام. قد تكون آليات الجمع المدخلات شفافة للمستخدم (مثل ربط واجهة برمجة تطبيقات بيانات الحسابات) أو تعتمد على خداع المستخدم لتقديم مدخلات فيما يعتقدون أنه خدمة أصلية (مثل Web Portal Capture)."
    },
    {
        "ID / المعرف": "T1056",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسجيل وجمع المدخلات / Input Capture",
        "الوصف / Description": "قد يقوم المهاجمين بتسجيل كبسات مفاتيح المستخدم لاعتراض بيانات الاعتماد أثناء قيام المستخدم بكتابتها. من المحتمل أن يتم استخدام Keylogging للحصول على بيانات حسابات المستخدم لفرص وصول جديدة عندما لا تكون عملية Dumping بيانات حسابات نظام التشغيل فعالة، وقد تتطلب من المهاجم اعتراض كبسات المفاتيح على النظام لفترة طويلة من الوقت قبل التمكن من التقاط بيانات الحسابات المستخدم بنجاح."
    },
    {
        "ID / المعرف": "T1056",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "تسجيل ضربات المفاتيح / Keylogging",
        "الوصف / Description": "قد يقوم المهاجمين بتسجيل كبسات مفاتيح المستخدم لاعتراض بيانات حسابات المستخدم أثناء قيامه بكتابتها. من المحتمل أن يتم استخدام Keylogging للحصول على بيانات حسابات المستخدم لفرص وصول جديدة عندما لا تكون عملية الDumping بيانات حسابات مستخدم نظام التشغيل فعالة، وقد تتطلب من المهاجم اعتراض كبسات المفاتيح على النظام لفترة طويلة من الوقت قبل التمكن من التقاط بيانات حسابات المستخدمين بنجاح."
    },
    {
        "ID / المعرف": "T1056",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "تسجيل واجهة التطبيقات / GUI Input Capture",
        "الوصف / Description": "قد يحاكي المهاجمين مكونات واجهة المستخدم الرسومية GUI لنظام التشغيل الشائعة لمطالبة المستخدمين ببيانات حسابات الوصول مع مطالبة تبدو مشروعة. عندما يتم تنفيذ البرامج التي تحتاج إلى امتيازات إضافية غير الموجودة في سياق المستخدم الحالي، فمن الشائع لنظام التشغيل مطالبة المستخدم ببيانات حساب الوصول المناسبة لتفويض الامتيازات للمهمة (على سبيل المثال: تجاوز التحكم في حساب المستخدم)."
    },
    {
        "ID / المعرف": "T1056",
        "المعرف الفرعي": ".003",
        "الاسم/ Name": "Web Portal Capture",
        "الوصف / Description": "قد يقوم المهاجمين بتثبيت برمجية على بوابات خارجية، مثل صفحة تسجيل الدخول إلى VPN، لالتقاط ونقل بيانات حسابات الوصول للمستخدمين الذين يحاولون تسجيل الدخول إلى الخدمة. على سبيل المثال، قد تسجل صفحة تسجيل الدخول المخترقة بيانات حساب المستخدم قبل تسجيل دخول المستخدم إلى الخدمة."
    },
    {
        "ID / المعرف": "T1056",
        "المعرف الفرعي": ".004",
        "الاسم/ Name": "سرقة بيانات API / Credential API Hooking",
        "الوصف / Description": "قد يرتبط المهاجمين بوظائف واجهة برمجة تطبيقات Windows (API) لجمع بيانات حسابات الوصول للمستخدم. قد تلتقط آليات الربط الضارة استدعاءات واجهة برمجة التطبيقات API التي تتضمن معلمات تكشف عن بيانات حسابات الوصول لمصادقة المستخدم. على عكس Keylogging، تركز هذه التقنية بشكل خاص على وظائف API التي تتضمن المعلمات التي تكشف عن بيانات حسابات المستخدم."
    },
    {
        "ID / المعرف": "T1185",
        "المعرف الفرعي": "",
        "الاسم/ Name": "اعتراض البيانات من خلال المتصفح / Man in the Browser",
        "الوصف / Description": "قد يرتبط المهاجمين بوظائف واجهة برمجة تطبيقات Windows (API) لجمع بيانات حسابات المستخدم. قد تلتقط آليات الربط الضارة استدعاءات API التي تتضمن معلمات تكشف عن بيانات حسابات مصادقة المستخدم. على عكس Keylogging، تركز هذه التقنية بشكل خاص على وظائف API التي تتضمن المعلمات التي تكشف عن بيانات حسابات المستخدم."
    },
    {
        "ID / المعرف": "T1557",
        "المعرف الفرعي": "",
        "الاسم/ Name": "اعتراض البيانات / Man-in-the-Middle",
        "الوصف / Description": "يمكن للمهاجمين الاستفادة من الثغرات الأمنية والوظائف الرئيسية في برنامج المتصفح لتغيير المحتوى وتعديل السلوك واعتراض المعلومات كجزء من تقنيات Man in The browser."
    },
    {
        "ID / المعرف": "T1557",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "LLMNR/NBT-NS Poisoning and SMB Relay",
        "الوصف / Description": "من خلال الاستجابة لحركة مرور شبكة LLMNR / NBT-NS ، قد ينتحل المهاجمين مصدرًا موثوقًا لتحليل الاسم لفرض الاتصال بنظام يتم التحكم فيه من قبل المهاجم. يمكن استخدام هذا النشاط لجمع أو نقل مواد المصادقة."
    },
    {
        "ID / المعرف": "T1557",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "ARP Cache Poisoning",
        "الوصف / Description": "قد يسمم المهاجمين بروتوكول(ARP) لوضع أنفسهم بين اتصال جهازين أو أكثر من الأجهزة المتصلة بالشبكة. يمكن استخدام هذا النشاط لتمكين سلوكيات المتابعة مثل التنصت في الشبكة أو التلاعب في البيانات المنقولة."
    },
    {
        "ID / المعرف": "T1113",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسجيل الشاشة / Screen Capture",
        "الوصف / Description": "قد يحاول المهاجمين أخذ لقطات شاشة لسطح المكتب لجمع المعلومات على مدار العملية. قد يتم تضمين وظيفة التقاط الشاشة كميزة لأداة الوصول عن بعد المستخدمة في عمليات ما بعد الاختراق. عادةً ما يكون التقاط لقطة شاشة ممكنًا من خلال الأدوات المساعدة الأصلية أو استدعاءات واجهة برمجة التطبيقات ، مثل CopyFromScreen أو xwd أو screencapture."
    },
    {
        "ID / المعرف": "T1125",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسجيل الفيديو / Video Capture",
        "الوصف / Description": "يمكن للمهاجم الاستفادة من الأجهزة الطرفية للكمبيوتر (على سبيل المثال ، الكاميرات المدمجة أو كاميرات الويب) أو التطبيقات (مثل خدمات مكالمات الفيديو) لالتقاط تسجيلات الفيديو بغرض جمع المعلومات. يمكن أيضًا التقاط الصور من الأجهزة أو التطبيقات، في فترات زمنية محددة، بدلاً من ملفات الفيديو."
    }
]