[
    {
        "ID / المعرف": "T1020",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسريب البيانات بشكل آلي / Automated Exfiltration",
        "الوصف / Description": "قد يقوم المهاجمين بتسريب البيانات ، مثل المستندات الحساسة و الملفات ، من خلال استخدام عمليات مؤتمتة بعد جمعها."
    },
    {
        "ID / المعرف": "T1020",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "البيانات المتكررة / Traffic Duplication",
        "الوصف / Description": "قد يستفيد المهاجمين من انعكاس حركة المرور traffic mirroring من أجل أتمتة تسريب البيانات عبر البنية التحتية للشبكة المستهدفة. تعد ميزة انعكاس حركة المرور ميزة مضمنة لبعض أجهزة الشبكة وتستخدم لتحليل الشبكة ويمكن تهيئتها لتكرار حركة المرور وإعادة التوجيه إلى وجهة واحدة أو أكثر لتحليلها بواسطة محلل الشبكة أو جهاز مراقبة آخر."
    },
    {
        "ID / المعرف": "T1030",
        "المعرف الفرعي": "",
        "الاسم/ Name": "نقل البيانات بواسطة احجام محددة / Data Transfer Size Limits",
        "الوصف / Description": "قد يقوم المهاجم بتسريب البيانات من خلال تجزئة البيانات الى احجام موحدة بدلاً من تسريب الملفات كاملة أو من الممكن أن يحد من أحجام الحزم التي تقل عن عتبات 'Threshold' معينة لكي لا يتم اكتشافها.  ويمكن استخدام هذا الأسلوب لتجنب التنبيهات من خلال مركز مراقبة بيانات الشبكة."
    },
    {
        "ID / المعرف": "T1048",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسريب البيانات بواسطة بروتوكول بديل / Exfiltration Over Alternative Protocol",
        "الوصف / Description": "قد يسرق المهاجمين البيانات عن طريق تسريبها عبر بروتوكول مختلف عن بروتوكول قناة التحكم والسيطرة (C&C)الحالية. يمكن أيضًا إرسال البيانات إلى شبكة بديلة عن خادم التحكم والسيطرة الرئيسي."
    },
    {
        "ID / المعرف": "T1048",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "Exfiltration Over Symmetric Encrypted Non-C2 Protocol",
        "الوصف / Description": "قد يسرق المهاجمين البيانات عن طريق تسريبها عبر بروتوكول شبكة مشفرة من نوع متماثل بخلاف بروتوكول قناة التحكم و السيطرة الموجودة. يمكن أيضًا إرسال البيانات إلى شبكة بديلة عن خادم التحكم والقيادة الرئيسي."
    },
    {
        "ID / المعرف": "T1048",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "Exfiltration Over Asymmetric Encrypted Non-C2 Protocol",
        "الوصف / Description": "قد يسرق المهاجمين البيانات من خلال تسريبها عبر بروتوكول شبكة مشفرة من النوع غير متماثل بخلاف بروتوكول قناة التحكم والسيطرة الموجودة. يمكن أيضًا إرسال البيانات إلى شبكة بديلة عن خادم التحكم والسيطرة الرئيسي."
    },
    {
        "ID / المعرف": "T1048",
        "المعرف الفرعي": ".003",
        "الاسم/ Name": "Exfiltration Over Unencrypted/Obfuscated Non-C2 Protocol",
        "الوصف / Description": "قد يسرق المهاجمين البيانات عن طريق تسريبها عبر بروتوكول شبكة غير مشفرة بخلاف بروتوكول قناة التحكم والسيطرة الموجودة. يمكن أيضًا إرسال البيانات إلى شبكة بديلة عن خادم التحكم والسيطرة الرئيسي."
    },
    {
        "ID / المعرف": "T1041",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسريب البيانات من خلال قناة تحكم وسيطرة / Exfiltration Over C2 Channel",
        "الوصف / Description": "قد يسرق المهاجمين البيانات عن طريق تسريبها عبر قناة التحكم والسيطرة الموجودة. البيانات المسروقة يتم ترميزها من خلال قناة الاتصالات العادية باستخدام نفس بروتوكول اتصالات التحكم والسيطرة."
    },
    {
        "ID / المعرف": "T1011",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسريب البيانات من خلال الشبكات البديلة Exfiltration Over Other Network Medium",
        "الوصف / Description": "قد يحاول المهاجمين بتسريب البيانات عبر  شبكة وسيطة مختلفة عن قناة التحكم والسيطرة. إذا كانت شبكة التحكم والسيطرة عبارة عن اتصال سلكي متصل بالانترنت، فقد يحدث التسريب ، على سبيل المثال ، عبر اتصال WiFi أو مودم أو اتصال بيانات خلوية أو Bluetooth أو قناة تردد راديو مختلفة (RF)."
    },
    {
        "ID / المعرف": "T1011",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "تسريب البيانات من خلال البلوتوث / Exfiltration Over Bluetooth",
        "الوصف / Description": "قد يحاول المهاجمين بتسريب البيانات عبر البلوتوث بدلاً من قناة التحكم والسيطرة. إذا كانت شبكة التحكم والسيطرة عبارة عن اتصال سلكي متصل بالانترنت ، فقد يختار المهاجم سرقة البيانات باستخدام قناة اتصال مثل Bluetooth."
    },
    {
        "ID / المعرف": "T1052",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسريب البيانات من خلال وسائط فيزيائية / Exfiltration Over Physical Medium",
        "الوصف / Description": "قد يحاول المهاجمين بتسريب البيانات عبر وسيط مادي ، مثل محرك أقراص قابل للإزالة. أمثلة على ذلك، اختراق الشبكة المعزولة عن الانترنت Air-gapped network ، ويمكن أن يحدث التسريب عبر وسيط مادي أو جهاز  مقدم من قبل المستخدم. يمكن أن تكون هذه الوسائط عبارة عن محرك أقراص ثابت خارجي أو محرك أقراص USB أو هاتف خلوي أو مشغل MP3 أو أي أجهزة تخزين أخرى. يمكن استخدام الوسيط المادي أو الجهاز كنقطة خروج نهائية أو للتنقل بين الأنظمة غير المتصلة."
    },
    {
        "ID / المعرف": "T1052",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "تسريب البيانات من خلال USB / Exfiltration over USB",
        "الوصف / Description": "قد يحاول المهاجمين بتسريب البيانات عبر جهاز مادي متصل بـ USB. أمثلة على ذلك، اختراق الشبكة المعزولة عن الانترنت Air-gapped network، ويمكن أن يحدث التسريب عبر جهاز USB مقدم من قبل المستخدم. يمكن استخدام جهاز USB كنقطة خروج نهائية أو للتنقل بين الأنظمة غير المتصلة."
    },
    {
        "ID / المعرف": "T1567",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسريب البيانات من خلال خدمات الويب / Exfiltration Over Web Service",
        "الوصف / Description": "قد يستخدم المهاجمين خدمة ويب خارجية موجودة وشرعية لتسريب البيانات بدلاً من قناة التحكم والسيطرة الخاصة بهم. قد توفر خدمات الويب الشائعة التي تستخدم لتسريب البيانات قدرًا كافيا من التغطية نظرًا لاحتمال وجود اتصال مسبق بين المستخدمين و الشبكة الداخلية قبل حدوث الاختراق. بالاضافة قد يوجد هناك سياسات في جدار الحماية تسمح في حركة المرور لهذه الخدمات."
    },
    {
        "ID / المعرف": "T1567",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "تسريب البيانات الى مستودع الاكواد / Exfiltration to Code Repository",
        "الوصف / Description": "قد يقوم المهاجمين بتسريب البيانات إلى مستودع الأكواد البرمجية بدلاً من قناة التحكم والسيطرة الخاصة بهم. غالبًا ما يمكن الوصول إلى مستودعات الأكواد عبر واجهة برمجة التطبيقات (على سبيل المثال: https://api.github.com). غالبًا يتم الوصول إلى واجهات برمجة التطبيقات هذه عبر  بروتوكول HTTPS ، مما يمنح المهاجم مستوى إضافي من الحماية."
    },
    {
        "ID / المعرف": "T1567",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "تسريب البيانات الى الخدمات السحابية / Exfiltration to Cloud Storage",
        "الوصف / Description": "قد يقوم المهاجمين بتسريب البيانات إلى خدمة التخزين السحابي بدلاً من قناة التحكم والسيطرة الخاصة بهم. تتيح خدمات التخزين السحابي تخزين البيانات وتحريرها واستردادها من خادم تخزين سحابي خارجي عبر الإنترنت."
    },
    {
        "ID / المعرف": "T1029",
        "المعرف الفرعي": "",
        "الاسم/ Name": "جدولة نقل البيانات / Scheduled Transfer",
        "الوصف / Description": "قد يقوم المهاجمين بجدولة تسريب البيانات ليتم عملها فقط في أوقات محددة في اليوم أو على فترات زمنية معينة. يمكن القيام بذلك مع الأنشطة العادية في الشبكة لتجنب الاكتشاف."
    },
    {
        "ID / المعرف": "T1537",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تسريب البيانات الى الحسابات السحابية / Transfer Data to Cloud Account",
        "الوصف / Description": "قد يقوم المهاجمين بتسريب البيانات عن طريق نقل البيانات ، بما في ذلك النسخ الاحتياطية من البيئات السحابية إلى حساب سحابي آخر يتم التحكم فيه في نفس الخدمة لتجنب عمليات نقل/تنزيلات الملفات وذلك لتفادي اكتشاف التسريب البيانات في الشبكة."
    }
]