[
    {
        "ID / المعرف": "T1531",
        "المعرف الفرعي": "",
        "الاسم/ Name": "مسح الحسابات / Account Access Removal",
        "الوصف / Description": "يحجب المهاجمون امكانية الوصول للموارد الشبكية أو الانظمة وذلك بهدف منع الوصول للمستخدمين المصرح لهم لحساباتهم او حذفها او اقفالها أو التلاعب بها على سبيل المثال تغيير بيانات كلمات المرور للحسابات بهدف منع الوصول."
    },
    {
        "ID / المعرف": "T1485",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تدمير البيانات / Data Destruction",
        "الوصف / Description": "يقوم المهاجمين بتدمير البيانات والملفات في نظام او انظمة متصلة بالشبكة وذلك لمنع التوافرية للأنظمة والخدمات وموارد الشبكة. ان تدمير البيانات هي عملية حذف بيانات غير قابلة للاسترجاع عن طريق تقنيات متقدمة لمنع التحقق الجنائي من استعادتها وذلك من خلال الكتابة فوق الملفات المحذوفة لمنع امكانية استرجاعها. في نظم التشغيل المعروفة يتم حذف الملفات من خلال أوامر del, rm وهنا يتم حذف نقاط الوصول الخاصة بالملفات من غير حذف المحتوى بداخل الملف، مما يجعل أمكانية استعادة الملفات ممكنة من خلال أدوات التحقيق الجنائي الرقمي. بعكس استخدم المحي (Wipe) حيث ستقوم بحذف الملف مباشرة."
    },
    {
        "ID / المعرف": "T1486",
        "المعرف الفرعي": "",
        "الاسم/ Name": "تشفير البيانات لتعظيم الاثر / Data Encrypted for Impact",
        "الوصف / Description": "يقوم المهاجمين بتشفير البيانات والملفات في الأنظمة المستهدفة او عدد كبير منها في الشبكة وذلك لمنع التوافرية في الأنظمة,الخدمات وموارد الشبكة. كذلك يجعلون الوصول غير ممكن للبيانات المحفوظة في القرص الصلب المحلي أو المتصلة عن بعد وذلك دون معرفة مفتاح فك التشفير.  يتم عمل ذلك ليتم الزام الضحية بالتعويض المالي لأجل اعطاءه مفتاح فك التشفير الملفات أو لمنع الوصول للملفات بشكل دائم.  في حال الفدية، يتم غالبا تشفير ملفات مستندات الأوفس, الصور, الفيديو, صوتيات وغيرها وفي بعض الأحيات يتم تشفير ملفات حساسة بالنظام ومنها MBR, Disk Partion."
    },
    {
        "ID / المعرف": "T1565",
        "المعرف الفرعي": "",
        "الاسم/ Name": "التلاعب بالبيانات / Data Manipulation",
        "الوصف / Description": "من الممكن أن يقوم المهاجمين بإضافة، حذف أو التلاعب بالبيانات من أجل تغيير المخرجات أو  ﻷخفاء نشاطه. التلاعب بالبيانات قد يؤثر على عملية سلامة الأعمال أو متخذين القرار."
    },
    {
        "ID / المعرف": "T1565",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "التلاعب بمخزن البيانات / Stored Data Manipulation",
        "الوصف / Description": "من الممكن أن يقوم المهاجمين بأضافة، حذف أو التلاعب بالبيانات المخزنة من أجل تغيير المخرجات أو  ﻷخفاء نشاطه. التلاعب بالبيانات المخزنة قد يؤثر على عملية الأعمال أو متخذين القرار."
    },
    {
        "ID / المعرف": "T1565",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "التلاعب بالبيانات المنقولة / Transmitted Data Manipulation",
        "الوصف / Description": "من الممكن أن يقوم المهاجمين  في تبديل البيانات المتجه للتخزين أو انظمة أخرى من أجل تغيير المخرجات أو ﻷخفاء نشاطه. التلاعب بالبيانات المنقولة قد يؤثر على عملية الأعمال أو متخذين القرار"
    },
    {
        "ID / المعرف": "T1565",
        "المعرف الفرعي": ".003",
        "الاسم/ Name": "التلاعب بالبيانات وقت العمل والتشغيل / Runtime Data Manipulation",
        "الوصف / Description": "من الممكن أن يقوم المهاجمين في تعديل الأنظمة للتلاعب بالبيانات وقت وصولها وعرضها للمستخدم. التلاعب بالبيانات وقت العمل والتشغيل قد يؤثر على عملية الأعمال أو متخذين القرار"
    },
    {
        "ID / المعرف": "T1491",
        "المعرف الفرعي": "",
        "الاسم/ Name": "التشوية او التغير   / Defacement",
        "الوصف / Description": "يقوم المهاجمين بتعديل المحتوى الظاهري المتوفر داخليا أو خارجيا لشبكة المنظومة. الأسباب وراء التشويه قد تكون لتوصيل رسالة، تخويف أو التفاخر او التطفل. تستخدم صور هجومية مزعجة."
    },
    {
        "ID / المعرف": "T1491",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "التشوية والتغير الداخلي / Internal Defacement",
        "الوصف / Description": "يقوم المهاجمين بتشويه الأنظمة الداخلية للمنظمة لمحاولة تخويف وتضليل المستخدمين. قد يكون على شكل تعديلات على مواقع الويب الداخلية، أو على أنظمة المستخدم مباشرة باستبدال خلفية سطح المكتب. يستخدم المهاجمون صور هجومية مزعجة. نظرًا لأن طريقة التشويه الداخلي تكشف وجود المهاجم، فغالبًا ما يحدث ذلك بعد تحقيق أهداف جميع أهدافه."
    },
    {
        "ID / المعرف": "T1491",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "التشوية و التغير الخارجي / External Defacement",
        "الوصف / Description": "يقوم المهاجمين بتشويه الأنظمة الخارجية للمنظمة لمحاولة توصيل رسالة أو تخويف وتضليل المستخدمين أو المنظمة. التشويه الخارجي يعتبر هو الأكثر شيوعا من ضحايا التشويه وذلك ﻷن المهاجمين أو مجموعات القراصنة تستخدمها لتوصيل رسالة سياسية أو نشر دعايات. التشويه الخارجي  تستخدم غالبا كمحفز لتحريك أحداث معينة ، أو ردت فعل على الإجراءات التي تتخذها منظمة أو حكومة. وبالمثل ، يمكن أيضًا استخدام تشويه موقع الويب كإعداد أو مقدمة للهجمات المستقبلية مثل Drive-by Compromise"
    },
    {
        "ID / المعرف": "T1561",
        "المعرف الفرعي": "",
        "الاسم/ Name": "محي القرص الصلب / Disk Wipe",
        "الوصف / Description": "يقوم المهاجمين بمحي أو تخريب البيانات الخام في القرص الصلب في نظام او أنظمة مرتبطة بشبكة وذلك لمنع التوافرية في الأنظمة و الخدمات وموارد الشبكة. وذلك بالقيام بالكتابة بشكل مباشر في القرص الصلب على البيانات المخزنة بداخلها. في بعض الأحيان يتم تشفير ملفات حساسة بالنظام ومنها MBR. قد تتم محاولة مسح كامل لجميع أجزاء القرص"
    },
    {
        "ID / المعرف": "T1561",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "محي محتوى البيانات من القرص الصلب  / Disk Content Wipe",
        "الوصف / Description": "يقوم المهاجمين بمحي المحتويات المخزنة في الأجهزة (نظام او العديد من الأنظمة) وذلك لمنع التوافرية في الأنظمة والخدمات وموارد الشبكة"
    },
    {
        "ID / المعرف": "T1561",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "محي هيكلة القرص الصلب Disk Structure Wipe",
        "الوصف / Description": "قد يقوم المهاجمين بإتلاف أو محي هياكل بيانات القرص الموجودة على محرك الأقراص الثابتة اللازمة لتشغيل النظام، وذلك باستهداف أنظمة حساسة في الشبكة وذلك لمنع التوافرية في الأنظمة و الخدمات وموارد الشبكة"
    },
    {
        "ID / المعرف": "T1499",
        "المعرف الفرعي": "",
        "الاسم/ Name": "حجب الخدمة للطرفية / Endpoint Denial of Service",
        "الوصف / Description": "قد يقوم المهاجمين في هجوم حجب الخدمة لمنع التوافرية في الوصول لخدمات للمستخدمين. هجوم حجب الخدمة يمكن قيامه عبر استهلاك موارد النظام التي يتم استخدامها أما من قبل الخدمات المستضافه بداخله أو مهاجمة النظام لإحداث حالة تعطل مستمرة. مثال على ذلك خدمات التي من الممكن تأثرها خدمة البريد، المواقع، نظام أسماء النطاقات DNS  والتطبيقات وغيرها، وهذه هي ابرز الخدمات قد يتمكن المهاجم من استغلالها لشن هجوم حجب الخدمة لأسباب متنوعة ومنها سياسة أو تهديدات أو ابتزاز."
    },
    {
        "ID / المعرف": "T1499",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "استهلاك موارد النظام / OS Exhaustion Flood",
        "الوصف / Description": "قد يقوم المهاجمين باستهداف نظام التشغيل (OS) بهجمات تعطيل الخدمة (DOS). ونظراً بسبب أهمية أنظمة التشغيل حيث تعتبر هي المسؤولة عن إدارة موارد النظام. وحيث ان مثل هذه الهجمات لا تحتاج الى استنفاد جميع موارد النظام الفعلية حيث انها ببساط يستطيع المهاجم مهاجمة الجزء الذي حدده النظام للقيام بالوظائف الخاصة بإدارة النظام و الموارد."
    },
    {
        "ID / المعرف": "T1499",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "استهلاك موارد الشبكة / Service Exhaustion Flood",
        "الوصف / Description": "يقوم المهاجمين في استهداف خدمات شبكية مختلفة مزودة من قبل النظام لعمل هجمة حجب وتعطيل الخدمة DOS. المهاجمين كثيرا ما يستهدفون خدمة الويب أو خدمة نظام أسماء النطاقاتDNS. برمجيات خادم الويب أيضا من الممكن استهدافه بطرق متنوعه وذلك اعتمادا على الخدمة المتاحة فيها."
    },
    {
        "ID / المعرف": "T1499",
        "المعرف الفرعي": ".003",
        "الاسم/ Name": "استهلاك موارد التطبيقات / Application Exhaustion Flood",
        "الوصف / Description": "قد يستهدف المهاجمين تطبيقات الويب التي تتميز بخدمات شديدة التفاعلية للتسبب في حجب الخدمة DoS. قد تكون الميزات المحددة في تطبيقات الويب عالية الاستخدام للموارد. قد تتمكن الطلبات المتكررة لهذه الميزات من استنفاد موارد النظام ورفض الوصول إلى التطبيق أو الخادم نفسه"
    },
    {
        "ID / المعرف": "T1499",
        "المعرف الفرعي": ".004",
        "الاسم/ Name": "اختراق التطبيقات او البرمجيات / Application or System Exploitation",
        "الوصف / Description": "قد يستغل المهاجمين ثغرات البرامج التي يمكن أن تتسبب في تعطيل تطبيق أو نظام ومنع للمستخدمين من الوصول له. قد تقوم بعض الأنظمة بإعادة تشغيل التطبيقات والخدمات الهامة تلقائيًا عند حدوث أعطال، ولكن من المحتمل إعادة استغلالها بشكل مستمر للتسبب في  استمرارية حجب الخدمة"
    },
    {
        "ID / المعرف": "T1495",
        "المعرف الفرعي": "",
        "الاسم/ Name": "عطب النظام الثابت او الداخلي / Firmware Corruption",
        "الوصف / Description": "قد يقوم المهاجمين بالكتابة فوق أو إتلاف محتويات ذاكرة الفلاش الخاصة بنظام BIOS أو البرامج الثابتة الأخرى في الأجهزة المتصلة بالنظام من أجل جعلها غير قابلة للتشغيل أو غير قادرة على الأقلاع. البرنامج الثابت هو برنامج يتم تحميله وتنفيذه من ذاكرة غير مستقرة على الأجهزة من أجل تهيئة وظائف الجهاز وإدارتها. يمكن أن تتضمن هذه الأجهزة اللوحة الأم أو محرك الأقراص الثابتة أو بطاقات الفيديو."
    },
    {
        "ID / المعرف": "T1490",
        "المعرف الفرعي": "",
        "الاسم/ Name": "منع استرداد النظام / Inhibit System Recovery",
        "الوصف / Description": "قد يقوم المهاجمين بحذف أو إزالة بيانات نظام التشغيل المضمنة وإيقاف تشغيل الخدمات المصممة للمساعدة في استرداد النظام التالف وذلك من أجل منع الاسترداد. قد تحتوي أنظمة التشغيل على ميزات يمكن أن تساعد في إصلاح الأنظمة التالفة ، مثل كتالوج النسخ الاحتياطي والنسخ الاحتياطية لوحدة التخزين volume shadow copies وميزات الإصلاح التلقائي. قد يقوم المهاجمين بتعطيل أو حذف ميزات استرداد النظام لزيادة تأثيرات تدمير البيانات وتشفير البيانات من أجل التأثير."
    },
    {
        "ID / المعرف": "T1498",
        "المعرف الفرعي": "",
        "الاسم/ Name": "حجب خدمات الشبكة / Network Denial of Service",
        "الوصف / Description": "قد ينفذ المهاجمين هجمات حجب الخدمة عبر الشبكة DoS لتقليل أو منع توافر الموارد المخصصة للمستخدمين. يمكن إجراء DoS للشبكة عن طريق استنفاد خدمات معدل نقل البيانات bandwidth للشبكة التي تعتمد عليها. أمثلة على الموارد هي مواقع ويب وخدمات البريد الإلكتروني ونظام أسماء النطاقات. لقد لوحظ أن المهاجمين يشنون هجمات حجب الخدمة على الشبكة لأغراض سياسية ولدعم الأنشطة الخبيثة الأخرى ، بما في ذلك الإلهاء والقرصنة والابتزاز"
    },
    {
        "ID / المعرف": "T1498",
        "المعرف الفرعي": ".001",
        "الاسم/ Name": "فيضان الشبكة المحدد / Direct Network Flood",
        "الوصف / Description": "قد يحاول المهاجمين التسبب في حجب الخدمة DoS  عن طريق إرسال حجم كبير من حركة مرور الشبكة إلى الهدف المراد. يحدث Direct Network Flood عندما يتم استخدام نظام واحد أو أكثر لإرسال عدد كبير من حزم الشبكة نحو خدمة الشبكة المستهدفة. يمكن استخدام أي بروتوكول شبكة تقريبًا للإغراق. يتم استخدام البروتوكولات مثل UDP أو ICMP بشكل شائع ولكن يمكن أيضًا استخدام البروتوكولات مثل TCP."
    },
    {
        "ID / المعرف": "T1498",
        "المعرف الفرعي": ".002",
        "الاسم/ Name": "تضخيم الانعكاس / Reflection Amplification",
        "الوصف / Description": "قد يقوم المهاجمين بالتسبب في حجب الخدمة من خلال عكس حجم كبير لحركة مرور الشبكة على الهدف المراد. يستفيد هذا النوع من Network DoS من وسيط خادم تابع لجهة خارجية يستضيف ويستجيب لعنوان الشبكي IP المنتحل Spoof. عادةً ما يُطلق على خادم الطرف الثالث هذا اسم عاكس(reflector). يعمل المهاجم هجومًا انعكاسيًا عن طريق إرسال حزم إلى عاكسات تحتوي على العنوان الشبكي المنتحل الخاص بالضحية. على غرار Direct Network Floods ، يمكن استخدام أكثر من نظام واحد لتنفيذ الهجوم ، أو يمكن استخدام البوت(bot). وبالمثل ، يمكن استخدام عاكس واحد أو أكثر لتركيز حركة المرور على الهدف."
    },
    {
        "ID / المعرف": "T1496",
        "المعرف الفرعي": "",
        "الاسم/ Name": "Resource Hijacking",
        "الوصف / Description": "قد يقوم المهاجمين من الاستفادة من مواد (co-opted systems) لرفع مستوى تفاعليتها مما يوثر على النظام او الخدمات المستضيفة للنظام."
    },
    {
        "ID / المعرف": "T1489",
        "المعرف الفرعي": "",
        "الاسم/ Name": "ايقاف الخدمات / Service Stop",
        "الوصف / Description": "قد يقوم المهاجمين بإيقاف الخدمات أو تعطيلها على النظام لجعل هذه الخدمات غير مفعلة لدى المستخدمين. يمكن أن يؤدي إيقاف الخدمات أو العمليات المهمة إلى منع الاستجابة للحادثة في حال وقوعها. وفي حال ايقاف الخدمات قد ينتفع المهاجمين  بتحقيق الأهداف المرادة وذلك لإلحاق الضرر بالمنظمة."
    },
    {
        "ID / المعرف": "T1529",
        "المعرف الفرعي": "",
        "الاسم/ Name": "ايقاف او اعادة تشغيل الانظمة / System Shutdown/Reboot",
        "الوصف / Description": "قد يقوم المهاجمين بإغلاق/إعادة تشغيل الأنظمة لمنع الوصول إلى هذه الأنظمة أو المساعدة في تدميرها. قد تحتوي أنظمة التشغيل على أوامر لبدء إيقاف تشغيل/ إعادة تشغيل الجهاز. في بعض الحالات ، يمكن أيضًا استخدام هذه الأوامر لبدء إيقاف تشغيل/إعادة تشغيل جهاز كمبيوتر عن بعد. قد يؤدي إيقاف تشغيل الأنظمة أو إعادة تشغيلها إلى تعطيل الوصول إلى موارد الكمبيوتر للمستخدمين المصرح لهم."
    }
]